{"address1": "Shihao Square", "address2": "16th Floor Middle Jiannan Boulevard High-Tech Zone", "city": "Chengdu", "zip": "610000", "country": "China", "phone": "86 28 6155 4399", "website": "https://www.senmiaotech.com", "industry": "Credit Services", "industryDisp": "Credit Services", "sector": "Financial Services", "longBusinessSummary": "Senmiao Technology Limited engages in the automobile transaction and related services business in the People's Republic of China. The company offers car rental services to individual customers; and auto finance solutions through financing leases. It also engages in automobile sales; and the provision of supporting services provided to online ride-hailing drivers, as well as management and guarantee services. In addition, the company provides new energy vehicles leasing and purchase services, as well as credit assessment, preparation of financing application materials, assistance with closing of financing transactions, license and plate registration, payment of taxes and fees, purchase of insurance, installation of GPS devices, ride-hailing driver qualification, and other administrative procedures. Further, it operates XXTX, an online ride-hailing platform that enables qualified ride-hailing drivers to provide transportation services mainly in Chengdu, Changsha, Guangzhou, and other 23 cities in China. The company was founded in 2014 and is headquartered in Chengdu, the People's Republic of China.", "fullTimeEmployees": 151, "companyOfficers": [{"maxAge": 1, "name": "Mr. Xi  Wen", "age": 38, "title": "Chairman, CEO, Pres & Sec.", "yearBorn": 1984, "fiscalYear": 2022, "totalPay": 233490, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Xiaoyuan  Zhang", "age": 34, "title": "CFO & Treasurer", "yearBorn": 1988, "fiscalYear": 2022, "totalPay": 84172, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Haitao  Liu", "age": 50, "title": "Chief Operating Officer", "yearBorn": 1972, "fiscalYear": 2022, "totalPay": 84141, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Xuedong  Tian C.F.A.", "age": 49, "title": "Investor Relations, Weitian Group LLC", "yearBorn": 1973, "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400}