{"address1": "9 West 57th Street", "address2": "42nd Floor", "city": "New York", "state": "NY", "zip": "10019", "country": "United States", "phone": "212 515 3200", "website": "https://www.apollo.com", "industry": "Asset Management", "industryDisp": "Asset Management", "sector": "Financial Services", "longBusinessSummary": "Apollo Global Management, Inc. is a private equity firm specializing in investments in credit, private equity and real estate markets. The firm's private equity investments include traditional buyouts, recapitalization, distressed buyouts and debt investments in real estate, corporate partner buyouts, distressed asset, corporate carve-outs, middle market, growth capital, turnaround, bridge, corporate restructuring, special situation, acquisition, and industry consolidation transactions. The firm provides its services to endowment and sovereign wealth funds, as well as other institutional and individual investors. It manages client focused portfolios. The firm launches and manages hedge funds for its clients. It also manages real estate funds and private equity funds for its clients. The firm invests in the fixed income and alternative investment markets across the globe. Its fixed income investments include income-oriented senior loans, bonds, collateralized loan obligations, structured credit, opportunistic credit, non-performing loans, distressed debt, mezzanine debt, and value oriented fixed income securities. The firm seeks to invest in chemicals, commodities, consumer and retail, oil and gas, metals, mining, agriculture, commodities, distribution and transportation, financial and business services, manufacturing and industrial, media distribution, cable, entertainment and leisure, telecom, technology, natural resources, energy, packaging and materials, and satellite and wireless industries. It also focuses on clean energy, sustainable industry, climate solutions, energy transition, industrial decarbonization, sustainable mobility, sustainable resource use, and sustainable real estate. It seeks to invest in companies based in across Africa, North America with a focus on United States, and Europe. The firm also makes investments outside North America, primarily in Western Europe and Asia. It employs a combination of contrarian, value, and distressed strategies to make its investments. The firm seeks to make investments in the range of $10 million and $1500 million. The firm seeks to invest in companies with Enterprise value between $750 million to $2500 million. The firm conducts an in-house research to create its investment portfolio. It seeks to acquire minority and majority positions in its portfolio companies. Apollo Global Management, Inc. was founded in 1990 and is headquartered in New York, New York with additional offices in North America, Asia , India and Europe.", "fullTimeEmployees": 2450, "companyOfficers": [{"maxAge": 1, "name": "Mr. Marc Jeffrey Rowan", "age": 59, "title": "Co-Founder, CEO & Director", "yearBorn": 1963, "fiscalYear": 2022, "totalPay": 310011, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Martin Bernard Kelly", "age": 54, "title": "Chief Financial Officer", "yearBorn": 1968, "fiscalYear": 2022, "totalPay": 2491637, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. John J. Suydam J.D.", "age": 62, "title": "Chief Legal Officer & Partner", "yearBorn": 1960, "fiscalYear": 2022, "totalPay": 4428714, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Scott M. Kleinman", "age": 49, "title": "Co-Pres of Apollo Asset Management Inc. & Director", "yearBorn": 1973, "fiscalYear": 2022, "totalPay": 8181234, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. James Richard Belardi", "age": 65, "title": "Co-Founder, CEO & Chief Investment Officer of Athene and Director", "yearBorn": 1957, "fiscalYear": 2022, "totalPay": 38266580, "exercisedValue": 0, "unexercisedValue": 11659038}, {"maxAge": 1, "name": "Richard  Ressler", "title": "Co-owner", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Byron C. Vielehr", "age": 59, "title": "Partner, COO & COO of Asset Management Bus.", "yearBorn": 1963, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Louis-Jacques  Tanguy", "title": "Partner of Fin. in New York, Chief Accounting Officer & Controller", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Jamey  Lamanna", "title": "Partner & Chief Information Officer of Global Technology in New York", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Noah  Gunn", "title": "MD & Global Head of Investor Relations in New York", "exercisedValue": 0, "unexercisedValue": 0}], "auditRisk": 4, "boardRisk": 3, "compensationRisk": 10, "shareHolderRightsRisk": 1, "overallRisk": 5, "governanceEpochDate": "2023-04-30 20:00:00", "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 32.2947329, "longitude": -64.7961749}