{"address1": "500 Laurel Street", "address2": "Suite 101", "city": "Baton Rouge", "state": "LA", "zip": "70801", "country": "United States", "phone": "225 248 7600", "website": "https://www.b1bank.com", "industry": "Banks—Regional", "industryDisp": "Banks—Regional", "sector": "Financial Services", "longBusinessSummary": "Business First Bancshares, Inc. operates as the bank holding company for b1BANK that provides various banking products and services. It offers various deposit products and services, including checking, demand, money market, time, and savings accounts; and certificates of deposits, remote deposit capture, and direct deposit services. The company also provides commercial and industrial loans, such as commercial lines of credit, letters of credit, working capital, term, equipment financing, asset acquisition, expansion and development, borrowing base, and other loan products; construction and development loans; commercial real estate loans; residential real estate loans comprising first and second lien 1-4 family mortgage loans, and home equity lines of credit; and consumer loans, including secured and unsecured installment and term loans. In addition, it offers wealth management products, including mutual funds, annuities, individual retirement accounts, and other financial products, as well as other fiduciary services and private banking products and services. Further, the company provides a range of other financial services comprising debit and credit cards, treasury and cash management, merchant, automated clearing house, lock-box, receivables factoring, correspondent banking, and other treasury services, as well as employee and payroll benefits solutions; and drive-through banking facilities, automated teller machines, night depository, personalized checks, electronic funds transfer, domestic and foreign wire transfer, traveler's checks, vault, loan and deposit sweep accounts, online and mobile banking, e-statements, and bank-by-mail services. It operates full-service banking centers and loan production offices across Louisiana, and in the Dallas and Houston markets. Business First Bancshares, Inc. was founded in 2006 and is headquartered in Baton Rouge, Louisiana.", "fullTimeEmployees": 727, "companyOfficers": [{"maxAge": 1, "name": "Mr. David R. Melville III", "age": 47, "title": "Pres, CEO & Director", "yearBorn": 1975, "fiscalYear": 2022, "totalPay": 1575913, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Gregory  Robertson", "age": 50, "title": "Exec. VP, CFO & Treasurer", "yearBorn": 1972, "fiscalYear": 2022, "totalPay": 643788, "exercisedValue": 0, "unexercisedValue": 75450}, {"maxAge": 1, "name": "Ms. Saundra  Strong", "age": 44, "title": "Corp. Sec.", "yearBorn": 1978, "fiscalYear": 2022, "totalPay": 470142, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Keith  Mansfield", "age": 45, "title": "Exec. VP & COO of b1 Bank", "yearBorn": 1977, "fiscalYear": 2022, "totalPay": 627320, "exercisedValue": 0, "unexercisedValue": 179600}, {"maxAge": 1, "name": "Mr. Norman Jerome Vascocu Jr.", "age": 48, "title": "Chief Admin. Officer", "yearBorn": 1974, "fiscalYear": 2020, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Matthew Michael Sealy", "title": "Sr. VP and Director of Corp. Strategy & FP&A", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Rodney Poncho Seaford", "title": "Regional Pres of SWLA", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Whitney  Dees", "title": "Assistant Sec.", "exercisedValue": 0, "unexercisedValue": 0}], "auditRisk": 9, "boardRisk": 5, "compensationRisk": 7, "shareHolderRightsRisk": 2, "overallRisk": 5, "governanceEpochDate": "2023-04-30 20:00:00", "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400}