{"address1": "82 Main Street", "address2": "PO Box 400", "city": "Bar Harbor", "state": "ME", "zip": "04609-0400", "country": "United States", "phone": "(207) 669-6784", "website": "https://www.barharbor.bank", "industry": "Banks—Regional", "industryDisp": "Banks—Regional", "sector": "Financial Services", "longBusinessSummary": "Bar Harbor Bankshares operates as the holding company for Bar Harbor Bank & Trust that provides banking and nonbanking products and services primarily to consumers and businesses. It accepts various deposit products, including interest-bearing and non-interest-bearing demand accounts, savings accounts, time deposits, and money market deposit accounts, as well as certificates of deposit. The company also provides commercial construction loans, such as raw land, land development, and construction of commercial and multifamily residential properties; commercial real estate owner occupied and non-owner occupied loans; tax exempt loans to various state and municipal government entities; commercial and industrial loans, including loans for the purpose of financing working capital and capital investment; residential real estate loans consists of one-to-four family homes; home equity loans; and consumer loans, including personal lines of credit and amortizing loans to qualified individuals for various purposes, such as auto loans, recreational equipment, overdraft protection, and other consumer loans. In addition, it provides life insurance, annuity, and retirement products, as well as financial planning services; and third-party investment and insurance services. Further, the company offers trust and estate administration, wealth advisory, and investment management services to individuals, businesses, not-for-profit organizations, and municipalities; and 401K plan, financial, estate and charitable planning, investment management, family office, municipal, and tax services. Bar Harbor Bankshares was founded in 1887 and is headquartered in Bar Harbor, Maine.", "fullTimeEmployees": 486, "companyOfficers": [{"maxAge": 1, "name": "Mr. Curtis C. Simard", "age": 51, "title": "Pres, CEO & Director", "yearBorn": 1971, "fiscalYear": 2022, "totalPay": 1267638, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Josephine  Iannelli", "age": 50, "title": "Exec. VP, CFO & Treasurer", "yearBorn": 1972, "fiscalYear": 2022, "totalPay": 708488, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Jason  Edgar", "age": 45, "title": "Pres of Bar Harbor Wealth Management", "yearBorn": 1977, "fiscalYear": 2022, "totalPay": 483986, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. William  Schaefer", "title": "Sr. VP of Fin.", "exercisedValue": 0, "unexercisedValue": 0}], "auditRisk": 1, "boardRisk": 2, "compensationRisk": 3, "shareHolderRightsRisk": 3, "overallRisk": 1, "governanceEpochDate": "2023-04-30 20:00:00", "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 32.2947329, "longitude": -64.7961749}