{"address1": "50 Hudson Yards", "city": "New York", "state": "NY", "zip": "10001", "country": "United States", "phone": "212 810 5800", "website": "https://www.blackrock.com", "industry": "Asset Management", "industryDisp": "Asset Management", "sector": "Financial Services", "longBusinessSummary": "BlackRock, Inc. is a publicly owned investment manager. The firm primarily provides its services to institutional, intermediary, and individual investors including corporate, public, union, and industry pension plans, insurance companies, third-party mutual funds, endowments, public institutions, governments, foundations, charities, sovereign wealth funds, corporations, official institutions, and banks. It also provides global risk management and advisory services. The firm manages separate client-focused equity, fixed income, and balanced portfolios. It also launches and manages open-end and closed-end mutual funds, offshore funds, unit trusts, and alternative investment vehicles including structured funds. The firm launches equity, fixed income, balanced, and real estate mutual funds. It also launches equity, fixed income, balanced, currency, commodity, and multi-asset exchange traded funds. The firm also launches and manages hedge funds. It invests in the public equity, fixed income, real estate, currency, commodity, and alternative markets across the globe. The firm primarily invests in growth and value stocks of small-cap, mid-cap, SMID-cap, large-cap, and multi-cap companies. It also invests in dividend-paying equity securities. The firm invests in investment grade municipal securities, government securities including securities issued or guaranteed by a government or a government agency or instrumentality, corporate bonds, and asset-backed and mortgage-backed securities. It employs fundamental and quantitative analysis with a focus on bottom-up and top-down approach to make its investments. The firm employs liquidity, asset allocation, balanced, real estate, and alternative strategies to make its investments. In real estate sector, it seeks to invest in Poland and Germany. The firm benchmarks the performance of its portfolios against various S&P, Russell, Barclays, MSCI, Citigroup, and Merrill Lynch indices. BlackRock, Inc. was founded in 1988 and is based in New York City with additional offices in Boston, Massachusetts; London, United Kingdom; Gurgaon, India; Hong Kong; Greenwich, Connecticut; Princeton, New Jersey; Edinburgh, United Kingdom; Sydney, Australia; Taipei, Taiwan; Singapore; Sao Paulo, Brazil; Philadelphia, Pennsylvania; Washington, District of Columbia; Toronto, Canada; Wilmington, Delaware; and San Francisco, California.", "fullTimeEmployees": 19500, "companyOfficers": [{"maxAge": 1, "name": "Mr. Laurence Douglas Fink", "age": 70, "title": "Chairman & CEO", "yearBorn": 1952, "fiscalYear": 2022, "totalPay": 9475555, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Robert Steven Kapito", "age": 66, "title": "Pres & Director", "yearBorn": 1956, "fiscalYear": 2022, "totalPay": 7133430, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Robert Lawrence Goldstein", "age": 48, "title": "Sr. MD, COO & Global Head of BlackRock Solutions", "yearBorn": 1974, "fiscalYear": 2022, "totalPay": 3104195, "exercisedValue": 0, "unexercisedValue": 7036193}, {"maxAge": 1, "name": "Mr. J. Richard Kushel", "age": 55, "title": "Sr. MD & Head of the Portfolio Management Group", "yearBorn": 1967, "fiscalYear": 2022, "totalPay": 2604195, "exercisedValue": 0, "unexercisedValue": 5277096}, {"maxAge": 1, "name": "Mr. Gary Stephen Shedlin", "age": 59, "title": "Vice Chairman", "yearBorn": 1963, "fiscalYear": 2022, "totalPay": 2214794, "exercisedValue": 0, "unexercisedValue": 5277096}, {"maxAge": 1, "name": "Dr. Bennett W. Golub Ph.D.", "age": 64, "title": "Co-Founder", "yearBorn": 1958, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Mark  McKenna", "title": "Founder, MD, Global Head of Event Driven Equity Strategies & Portfolio Mang.", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Martin  Small", "title": "Sr. MD, CFO & Global Head of Corp. Strategy", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Dr. Jeff  Shen Ph.D.", "title": "MD, Co-CIO & Co-Head of Systematic Active Equity (SAE)", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Neeraj  Seth", "title": "MD, Chief Investment Officer & Head of Asian credit \u0096 Singapore", "exercisedValue": 0, "unexercisedValue": 0}], "auditRisk": 5, "boardRisk": 6, "compensationRisk": 6, "shareHolderRightsRisk": 1, "overallRisk": 3, "governanceEpochDate": "2023-04-30 20:00:00", "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 32.2947329, "longitude": -64.7961749}