{"address1": "100 Park Avenue", "address2": "25th Floor", "city": "New York", "state": "NY", "zip": "10017", "country": "United States", "phone": "212-418-4700", "fax": "212-418-4739", "website": "https://www.cionbdc.com", "industry": "Asset Management", "industryDisp": "Asset Management", "sector": "Financial Services", "longBusinessSummary": "CION Investment Corporation is a business development company. It specializes in investments in senior secured loans, including unitranche loans, First Lien, second lien loans, long-term subordinated loans, and mezzanine loans; equity interests such as warrants or options; and corporate bonds; and other debt securities in middle-market companies. The firm invests in growth capital, acquisitions, leveraged buyouts, market/product expansion, refinancing and recapitalization. The fund also invests up to 30 percent of their assets opportunistically in other types of investments, including the securities of larger public companies and foreign securities. It also makes investments in the secondary loan market. The fund does not invest in start-up companies, turnaround situations, or companies with speculative business plans. The fund prefers to invest in high tech industries, healthcare, pharmaceuticals, business services, media, chemicals, plastic, rubber, telecommunication, consumer services, advertising, printing and publishing, consumer goods, durables, diversified financials, and other industries. It also invests in homebuilding, restaurants, beverage and tobacco bars, broadcasting, distributors, Non-durable good distribution, food beverage and tobacco, energy, oil gas and consumables fuels, insurance, aerospace and defense, industrial machinery, paper and forest product machinery, information technology, metals and mining, and real estate. It primarily seeks to invest in the United States. The fund seeks to invest between $5 million and $50 million in companies with an EBITDA between $25 million and $75 million with average targeted hold of $25 million. It also purchases minority interests in the form of common or preferred equity in the target companies, typically in conjunction with its debt investments or through a co-investment with a financial sponsor. The fund seeks to exit its investments through an initial public offering of common stock, a merger, a sale, or other recapitalization.", "companyOfficers": [{"maxAge": 1, "name": "Mr. Michael A. Reisner Esq., J.D.", "age": 51, "title": "Co-Founder & Co-Chairman & Co-CEO", "yearBorn": 1971, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Mark  Gatto J.D.", "age": 49, "title": "Co-Founder, Co-Chairman & Co-CEO", "yearBorn": 1973, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Gregg A. Bresner CFA", "title": "Pres & Chief Investment Officer", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Joe  Elsabee", "title": "Managing Director", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Keith S. Franz CPA", "age": 53, "title": "MD, Treasurer & CFO", "yearBorn": 1969, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Stephen  Roman", "age": 40, "title": "Chief Compliance Officer, Counsel & Sec.", "yearBorn": 1982, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Eric A. Pinero", "age": 46, "title": "Chief Legal Officer", "yearBorn": 1976, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Alexander  Cavalieri", "title": "MD and Head of Marketing & Strategy", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Geoffrey A. Manna", "title": "Sr. Managing Director", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Aditi  Budhia", "title": "Sr. VP", "exercisedValue": 0, "unexercisedValue": 0}], "maxAge": 86400}