{"address1": "700 Louisiana Street", "address2": "48th Floor", "city": "Houston", "state": "TX", "zip": "77002", "country": "United States", "phone": "888-323-4533", "fax": "212-671-1534", "website": "https://www.equuscap.com", "industry": "Asset Management", "industryDisp": "Asset Management", "sector": "Financial Services", "longBusinessSummary": "Equus Total Return, Inc. is a business development company (BDC) specializing in leveraged buyouts, management buyouts, corporate partnerships/joint ventures, growth and expansion capital, acquisition financing, roll-up acquisition strategies, operational turnarounds, recapitalizations of existing businesses, special situations, equity and equity-oriented securities issued by privately owned companies, debt securities including subordinate debt, debt convertible into common or preferred stock, or debt combined with warrants and common and preferred stock, and preferred equity financing. It invests in small to mid-sized companies and acts as a lead investor. It invests in technology, telecommunication, financial services, natural resource and industrial manufacturing and services. It invests in companies engaged in the alternative energy, real estate, healthcare, education, e-learning, leisure and entertainment, and foreign investment sector in the United States, China, India, and Europe. It investments include common and preferred stock, debt convertible into common or preferred stock, debt combined with warrants and options, and other rights to acquire common or preferred stock. It seeks to invest in companies between $1 million to $25 million with revenues between $5 million and $150 million with EBITDA between $2 million to $50 million. It seeks to take control and non-control equity positions. Equus Total Return, Inc. was founded in 1991 and is based in Houston, Texas with additional office in Vancouver, Canada.", "companyOfficers": [{"maxAge": 1, "name": "Mr. John A. Hardy", "age": 70, "title": "CEO & Director", "yearBorn": 1952, "fiscalYear": 2022, "totalPay": 959978, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. L'Sheryl Deirdre Hudson", "age": 57, "title": "CFO, Sr. VP & Treasurer", "yearBorn": 1965, "fiscalYear": 2022, "totalPay": 325746, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Kenneth Ian Denos Esq., J.D.", "age": 54, "title": "Chief Compliance Officer, Sec. & Director", "yearBorn": 1968, "fiscalYear": 2022, "totalPay": 394227, "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 29.760636007301812, "longitude": -95.36647801071707}