{"address1": "Pearl River Tower", "address2": "60th Floor No. 15 West Zhujiang Road", "city": "Guangzhou", "zip": "510623", "country": "China", "phone": "86 20 8388 6888", "website": "https://www.fanhuaholdings.com", "industry": "Insurance Brokers", "industryDisp": "Insurance Brokers", "sector": "Financial Services", "longBusinessSummary": "Fanhua Inc., together with its subsidiary, distributes insurance products in China. It operates through two segments, Insurance Agency and Claims Adjusting. The Insurance Agency segment provides property and casualty insurance products that primarily include individual accident, travel, homeowner, and indemnity medical insurance products; and life insurance products, such as individual health, individual whole life, individual term life, individual endowment life, and individual annuity, as well as participating insurance products. The Claims Adjusting segment offers pre-underwriting survey, claims adjusting, residual value disposal, loading and unloading supervision, and consulting services. The company also operates baoxian.com, an online insurance distribution platform; Lan Zhanggui, an all-in-one insurance sales and service platform; ehuzhu.com, an online mutual aid platform, as well as Fanhua RONS DOP, a digital marketing platform; Fanhua RONS Guanjia, a customer service platform; and Fanhua WeCom that enables agents to directly interact with existing and potential customers. It serves customers through insurance sales and service group, and insurance agencies, as well as sales and service branches and outlets, registered independent sales agents, and in-house claims adjustors. The company was formerly known as CNinsure Inc. and changed its name to Fanhua Inc. in December 2016. Fanhua Inc. was founded in 1998 and is headquartered in Guangzhou, China.", "fullTimeEmployees": 5238, "companyOfficers": [{"maxAge": 1, "name": "Mr. Yinan  Hu", "age": 56, "title": "Founder, CEO & Chairman", "yearBorn": 1966, "fiscalYear": 2016, "totalPay": 0, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Peng  Ge", "age": 51, "title": "CFO & Exec. Director", "yearBorn": 1971, "fiscalYear": 2016, "totalPay": 0, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Lichong  Liu", "age": 49, "title": "VP & COO", "yearBorn": 1973, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Oasis  Qiu", "title": "Investor Relations Mang.", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Jun  Li", "age": 48, "title": "VP & Chief Digital Officer", "yearBorn": 1974, "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2016-12-30 19:00:00", "maxAge": 86400, "latitude": 32.2947329, "longitude": -64.7961749}