{"address1": "1500 Nitterhouse Drive", "city": "Chambersburg", "state": "PA", "zip": "17201-0819", "country": "United States", "phone": "717 264 6116", "website": "https://www.franklinfin.com", "industry": "Banks—Regional", "industryDisp": "Banks—Regional", "sector": "Financial Services", "longBusinessSummary": "Franklin Financial Services Corporation operates as the bank holding company for Farmers and Merchants Trust Company of Chambersburg that provides commercial, retail banking, and trust services to small and medium-sized businesses, individuals, governmental entities, and non-profit organizations in Pennsylvania. It offers various deposit products, including checking, savings, money management, and time deposit accounts, as well as demand deposits. The company also provides commercial real estate, construction and land development, agricultural, commercial and industrial, and residential mortgage loans, as well as installment and revolving loans to consumers; and secured and unsecured commercial and industrial loans, including accounts receivable and inventory financing, and commercial equipment financing. In addition, it offers various investment and trust services comprising estate planning and administration, corporate and personal trust fund management, pension, and profit sharing and other employee benefit funds management services, as well as custodial services; sells mutual funds, annuities, and insurance products; and offers safe deposit facilities and fiduciary services. Further, the company, through its subsidiary, Franklin Future Fund Inc., operates as a non-bank investment company that makes venture capital investments. The company was founded in 1906 and is headquartered in Chambersburg, Pennsylvania.", "fullTimeEmployees": 298, "companyOfficers": [{"maxAge": 1, "name": "Mr. Timothy G. Henry", "age": 63, "title": "Pres, CEO & Director", "yearBorn": 1959, "fiscalYear": 2022, "totalPay": 609520, "exercisedValue": 0, "unexercisedValue": 29197}, {"maxAge": 1, "name": "Mr. Mark R. Hollar", "age": 60, "title": "Sr. VP, CFO & Treasurer", "yearBorn": 1962, "fiscalYear": 2022, "totalPay": 335642, "exercisedValue": 0, "unexercisedValue": 103411}, {"maxAge": 1, "name": "Amanda M. Ducey", "title": "Corp. Sec.", "exercisedValue": 0, "unexercisedValue": 0}], "auditRisk": 9, "boardRisk": 5, "compensationRisk": 4, "shareHolderRightsRisk": 9, "overallRisk": 6, "governanceEpochDate": "2023-04-30 20:00:00", "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 32.2947329, "longitude": -64.7961749}