{"address1": "Esentai Tower BC", "address2": "Floor 7 77/7 Al Farabi Avenue", "city": "Almaty", "zip": "050040", "country": "Kazakhstan", "phone": "7 727 311 1064", "website": "https://www.freedomholdingcorp.com", "industry": "Capital Markets", "industryDisp": "Capital Markets", "sector": "Financial Services", "longBusinessSummary": "Freedom Holding Corp., through its subsidiaries, provides retail securities brokerage, research, investment counseling, securities trading, market making, retail banking, corporate investment banking, and underwriting services. The company offers investment brokerage services for exchange-traded and over-the-counter corporate equity and debt securities, money market instruments, exchange traded options and futures contracts, government bonds, and mutual funds; margin lending services collateralized by securities and cash in the customer's account; various investment education and training courses; investment research services; and commercial banking services, including payment cards, digital mortgages, and digital auto loans, as well as insurance products. It also provides capital raising solutions for corporate clients through initial public offerings and follow-on offerings; and debt capital markets solutions that focuses on structuring and distributing private and public debt for various purposes, including buyouts, acquisitions, growth capital financings, and recapitalizations. In addition, the company is involved in trading, investment, and brokerage activities. Further, it facilitates repurchase and reverse repurchase agreements in proprietary trading activities; and covers short positions and settle other securities obligations to accommodate customers' needs and finance its inventory positions. Additionally, the company offers Tradernet software platform for client margin risk evaluation and middle office security transfer requests. It operates in Central Asia, Europe, the United States, Russia, and the Middle East/Caucasus. The company was formerly known as BMB Munai, Inc. and changed its name to Freedom Holding Corp. Freedom Holding Corp. was incorporated in 1981 and is headquartered in Almaty, Kazakhstan.", "fullTimeEmployees": 2529, "companyOfficers": [{"maxAge": 1, "name": "Mr. Timur Ruslanovich Turlov", "age": 34, "title": "CEO & Chairman", "yearBorn": 1988, "fiscalYear": 2022, "totalPay": 1255014, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Askar Bolatovich Tashtitov", "age": 43, "title": "Pres & Director", "yearBorn": 1979, "fiscalYear": 2022, "totalPay": 800614, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Evgeniy Oskarovich Ler", "age": 39, "title": "Chief Financial Officer", "yearBorn": 1983, "fiscalYear": 2022, "totalPay": 686747, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Liudmila  Kiriaku", "age": 40, "title": "VP of Compliance", "yearBorn": 1982, "fiscalYear": 2022, "totalPay": 234504, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Renat  Tukanov", "title": "Chief Technology Officer", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Adam R. Cook", "age": 49, "title": "Corp. Sec.", "yearBorn": 1973, "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 32.2947329, "longitude": -64.7961749}