{"address1": "3291 U.S. Highway 280", "city": "Birmingham", "state": "AL", "zip": "35243", "country": "United States", "phone": "205-582-1200", "website": "https://www.fusb.com", "industry": "Banks—Regional", "industryDisp": "Banks—Regional", "sector": "Financial Services", "longBusinessSummary": "First US Bancshares, Inc. operates as the bank holding company for First US Bank that provides commercial banking products and services. The company offers non-interest-bearing demand deposits, savings accounts, NOW accounts, money market demand accounts, individual retirement accounts, and time deposits. Its loan products include commercial construction, land, and land development loans; mortgage loans on one-to-four family and multi-family residential properties; real estate loans secured by commercial and industrial properties, office or mixed-use facilities, strip shopping centers, or other commercial properties; commercial and industrial loans and leases; and secured and unsecured personal loans, including automobile loans, loans for household and personal purposes, and other direct consumer installment loans. The company also provides loans secured by personal property items. In addition, it provides letters of credit; and safe deposit box and remote deposit capture services, as well as underwrites credit life, credit accident, health insurance, and reinsurance policies. The company serves small-and medium-sized businesses, property managers, business executives, professionals, and other individuals. The company was formerly known as United Security Bancshares, Inc. and changed its name to First US Bancshares, Inc. in October 2016. First US Bancshares, Inc. was founded in 1952 and is headquartered in Birmingham, Alabama.", "fullTimeEmployees": 155, "companyOfficers": [{"maxAge": 1, "name": "Mr. James F. House", "age": 70, "title": "Pres, CEO & Non Independent Director", "yearBorn": 1952, "fiscalYear": 2016, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Thomas S. Elley", "age": 50, "title": "VP, CFO, Principal Accounting Officer, Treasurer & Assistant Sec.", "yearBorn": 1972, "fiscalYear": 2016, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. William Christopher Mitchell", "age": 56, "title": "Sr. Exec. VP of Consumer Lending of First US Bank", "yearBorn": 1966, "fiscalYear": 2016, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Beverly J. Dozier", "age": 57, "title": "VP, Corp. Sec. & Assistant Treasurer", "yearBorn": 1965, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Eric H. Mabowitz", "age": 63, "title": "Sr. Exec. VP, Chief Risk Officer, Chief Compliance Officer & CRA Officer of First US Bank", "yearBorn": 1959, "fiscalYear": 2011, "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 32.2947329, "longitude": -64.7961749}