{"address1": "112 West King Street", "city": "Strasburg", "state": "VA", "zip": "22657", "country": "United States", "phone": "(540) 465-9121", "website": "https://www.fbvirginia.com", "industry": "Banks—Regional", "industryDisp": "Banks—Regional", "sector": "Financial Services", "longBusinessSummary": "First National Corporation operates as the bank holding company for First Bank that provides various commercial banking services to small and medium-sized businesses, individuals, estates, local governmental entities, and non-profit organizations in Virginia. The company's deposit products include checking, savings, money market, and individual retirement accounts, as well as certificates of deposit and treasury management solutions. Its loan products comprise construction loans, including residential, land acquisition, and development loans; 1-4 family residential real estate loans; and commercial real estate loans that are secured by commercial real estate, including multi-family residential buildings, office and retail buildings, hotels, industrial buildings, and religious facilities. The company's loan products also include commercial and industrial loans that are secured by business assets, such as accounts receivable, equipment, and inventory; home equity loans; and secured and unsecured consumer loans, such as lines of credit, automobile loans, deposit account loans, and installment and demand loans. In addition, it provides wealth management services, including estate planning, investment management of assets, trustee under an agreement, trustee under a will, and estate settlement. Further, the company offers title insurance and investment services; and holds other real estate owned and office sites, as well as provides internet and mobile banking, remote deposit capture, and other traditional banking services. First National Corporation was founded in 1907 and is headquartered in Strasburg, Virginia.", "companyOfficers": [{"maxAge": 1, "name": "Mr. Scott C. Harvard", "age": 67, "title": "Pres, CEO & Director", "yearBorn": 1955, "fiscalYear": 2022, "totalPay": 649520, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Gerald F. Smith Jr.", "age": 60, "title": "Independent Vice Chair of the Board & Sec.", "yearBorn": 1962, "fiscalYear": 2022, "totalPay": 27800, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. M. Shane Bell", "age": 49, "title": "Exec. VP & CFO", "yearBorn": 1973, "fiscalYear": 2022, "totalPay": 366095, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Dennis A. Dysart", "age": 50, "title": "Pres & COO", "yearBorn": 1972, "fiscalYear": 2022, "totalPay": 402029, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. W. Todd Ross", "title": "Market Pres", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Paul K. Martin", "title": "Sr. VP and Market Pres of Staunton, Waynesboro, Augusta, Harrisonburg & Rockingham County", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Matt  Paciocco", "title": "Sr. VP & Regional Exec. for Richmond", "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 32.2947329, "longitude": -64.7961749}