{"address1": "F3, Hywin Financial Centre", "address2": "8 Yincheng Middle Road Pudong New District", "city": "Shanghai", "zip": "200120", "country": "China", "phone": "86 21 8013 3992", "website": "https://ir.hywinwealth.com", "industry": "Asset Management", "industryDisp": "Asset Management", "sector": "Financial Services", "longBusinessSummary": "Hywin Holdings Ltd., together with its subsidiaries, engages in the provision of wealth management, asset management, health management, insurance brokerage, and other financial services in China. The company distributes private market investment products comprising asset-backed products, such as real estate securitization products, as well as equity investments in real estate projects or private project companies; venture capital, private equity, and hedge funds; and supply chain financing products, cash management products, and funds managed by its subsidiaries. It also offers public market investment products, including money market funds, such as government bonds, central bank bills, term and certificates of deposits, and corporate commercial papers; government, corporate, and convertible bonds, as well as other traded debt instruments; and equities and multi-strategy funds. In addition, the company provides individual whole life insurance, individual term life insurance, universal life insurance, individual health insurance, and annuity insurance products, as well as critical illness insurance comprising personal accident insurance products; discretionary and advisory mandates to ultra-high-net-worth clients; and overseas property investment services for residential properties, as well as client referrals to overseas and charge property developers. Further, it manages and distributes a range of private funds to professional investors; and offers information technology services, including transaction process management, data analysis, and system maintenance services to asset management service and financial product providers. The company was founded in 2006 and is headquartered in Shanghai, China. Hywin Holdings Ltd. is a subsidiary of Grand Lead Group Limited.", "fullTimeEmployees": 2552, "companyOfficers": [{"maxAge": 1, "name": "Ms. Dian  Wang", "age": 53, "title": "CEO & Director", "yearBorn": 1969, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Wai  Lok", "age": 40, "title": "Chief Financial Officer", "yearBorn": 1982, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Kai  Mu", "age": 37, "title": "Chief Operating Officer", "yearBorn": 1985, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Hua  Zhu", "title": "Chief Technology Officer", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Zheng  Geng", "title": "Compliance Officer", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Zheng  Liu", "age": 39, "title": "Chief Marketing Officer", "yearBorn": 1983, "exercisedValue": 0, "unexercisedValue": 0}], "maxAge": 86400}