{"address1": "No. 15-04 Royal Group Building", "address2": "3 Phillip Street", "city": "Singapore", "zip": "048693", "country": "Singapore", "phone": "65 8877 3871", "website": "https://www.liongrouphl.com", "industry": "Capital Markets", "industryDisp": "Capital Markets", "sector": "Financial Services", "longBusinessSummary": "Lion Group Holding Ltd., together with its subsidiaries, operates a trading platform for corporate clients, individual traders, and retail investors. Its trading platform offers a range of products and services comprising contracts for difference trading, insurance brokerage, futures and securities brokerage, total return swap trading, and asset management services. The company's trading platform allows users to trade various futures products on futures exchanges worldwide, including the Chicago Mercantile Exchange, Singapore Exchange, the Hong Kong Futures Exchange, and Eurex Exchange; stocks listed on the New York Stock Exchange, Nasdaq and Hong Kong Stock Exchange; and the People's Republic of China stocks listed on the Shanghai Stock Exchange and Shenzhen Stock Exchange that are eligible for the Shanghai-Hong Kong Stock Connect and Shenzhen-Hong Kong Stock Connect programs. It also creates, mints, and sells the MetaWords NFTs; and operates Lion NFT platform for buying and selling the MetaWords NFTs. The company has a strategic partnership with Dawa Future Graphic Technology Co., Ltd. to develop its Lion World Metaverse project. Lion Group Holding Ltd. was founded in 2015 and is headquartered in Singapore.", "fullTimeEmployees": 38, "companyOfficers": [{"maxAge": 1, "name": "Mr. Jian  Wang", "age": 40, "title": "Co-Founder & Chairman", "yearBorn": 1982, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Chunning  Wang", "age": 43, "title": "CEO & Director", "yearBorn": 1979, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Yan  Zhang", "age": 41, "title": "Pres & Director", "yearBorn": 1981, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Sze Hau  Lee", "age": 36, "title": "Chief Financial Officer", "yearBorn": 1986, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Hua  Luo", "age": 37, "title": "COO & Director", "yearBorn": 1985, "exercisedValue": 0, "unexercisedValue": 0}], "maxAge": 86400}