{"address1": "300 North Water Street", "city": "Salem", "state": "IN", "zip": "47167", "country": "United States", "phone": "812 883 2639", "website": "https://www.mid-southern.com", "industry": "Banks—Regional", "industryDisp": "Banks—Regional", "sector": "Financial Services", "longBusinessSummary": "Mid-Southern Bancorp, Inc. operates as the holding company for Mid-Southern Savings Bank, FSB that provides various banking products and services to individuals and business customers. It accepts various deposit products, including checking, savings, money market, and demand accounts, as well as certificates of deposit and term deposits. The company also offers loans secured by first mortgages on one- to four-family residences, including home equity loans and lines of credit; commercial and multifamily real estate loans; construction loans secured by single-family residences; commercial and multifamily real estate loans; land and lot loans; commercial business loans; consumer loans, including new and used manufactured homes, automobiles and truck, boats, and motorcycles and recreational vehicle loans; loans secured by savings deposits and other personal loans; and unsecured consumer loans. In addition, it holds and manages an investment securities portfolio. The company provides its products and services through its main office in Salem; and through its branch offices located in Mitchell and Orleans, Indiana, as well as through loan production offices located in New Albany, Indiana and Louisville, Kentucky. The company was founded in 1886 and is headquartered in Salem, Indiana.", "fullTimeEmployees": 40, "companyOfficers": [{"maxAge": 1, "name": "Mr. Alexander G. Babey", "age": 53, "title": "Pres, CEO & Director", "yearBorn": 1969, "fiscalYear": 2022, "totalPay": 233164, "exercisedValue": 0, "unexercisedValue": 2}, {"maxAge": 1, "name": "Mr. Robert W. DeRossett", "age": 52, "title": "Chief Financial Officer", "yearBorn": 1970, "fiscalYear": 2022, "totalPay": 140431, "exercisedValue": 0, "unexercisedValue": 2}, {"maxAge": 1, "name": "Mr. James O. King III", "age": 48, "title": "Exec. VP, Sr. Lending Officer & Director", "yearBorn": 1974, "fiscalYear": 2022, "totalPay": 195555, "exercisedValue": 0, "unexercisedValue": 2}, {"maxAge": 1, "name": "Ms. Erica B. Schmidt", "age": 43, "title": "Exec. VP, Corp. Sec. & Treasurer", "yearBorn": 1979, "fiscalYear": 2021, "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 38.60818898240487, "longitude": -86.1024409654096}