{"address1": "325 Hamilton Avenue", "city": "White Plains", "state": "NY", "zip": "10601", "country": "United States", "phone": "914 684 2500", "website": "https://www.necommunitybank.com", "industry": "Banks—Regional", "industryDisp": "Banks—Regional", "sector": "Financial Services", "longBusinessSummary": "Northeast Community Bancorp, Inc. operates as the holding company for NorthEast Community Bank that provides financial services for individuals and businesses. It accepts various deposit instruments, including checking accounts, money market accounts, regular savings accounts, and non-interest bearing demand accounts, as well as certificates of deposits. The company also offers construction, commercial and industrial, multifamily and mixed-use real estate, non-residential real estate loans, and consumer loans. In addition, it invests in various types of liquid assets, including U.S. Treasury obligations, municipal securities, deposits at the Federal Home Loan Bank of New York, and certificates of deposit of federally insured institutions, as well as securities of various federal agencies, and of state and municipal governments. Further, the company offers financial planning and investment advisory services; and life insurance products and fixed-rate annuities. It operates full-service branches located in Bronx, New York, Orange, Rockland, and Sullivan Counties in New York and Essex, Middlesex, and Norfolk Counties in Massachusetts; and loan production offices located in White Plains, New York, and New City counties in New York and Danvers, Massachusetts. The company was founded in 1934 and is headquartered in White Plains, New York.", "fullTimeEmployees": 134, "companyOfficers": [{"maxAge": 1, "name": "Mr. Kenneth A. Martinek", "age": 70, "title": "Chairman & CEO", "yearBorn": 1952, "fiscalYear": 2022, "totalPay": 897433, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Jose M. Collazo", "age": 56, "title": "Pres, COO & Director", "yearBorn": 1966, "fiscalYear": 2022, "totalPay": 658405, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Donald S. Hom", "age": 67, "title": "Exec. VP & CFO", "yearBorn": 1955, "fiscalYear": 2022, "totalPay": 476033, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Anne  Stevenson-DeBlasi", "title": "Corp. Sec.", "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400}