{"address1": "85 Broad Street", "city": "New York", "state": "NY", "zip": "10004", "country": "United States", "phone": "212 668 8000", "website": "https://www.oppenheimer.com", "industry": "Capital Markets", "industryDisp": "Capital Markets", "sector": "Financial Services", "longBusinessSummary": "Oppenheimer Holdings Inc., through its subsidiaries, operates as a middle-market investment bank and full-service broker-dealer in the Americas, Europe, the Middle East, and Asia. The company offers brokerage services covering corporate equity and debt securities, money market instruments, exchange-traded options and futures contracts, municipal bonds, mutual funds, exchange-traded funds, and unit investment trusts; financial and wealth planning services; and margin lending services. It also provides asset management services, including separately managed accounts, mutual fund managed accounts, discretionary portfolio management programs, non-discretionary investment advisory and consultation services, alternative investments, portfolio enhancement programs, and institutional taxable fixed income portfolio management strategies and solutions, as well as taxable and non-taxable fixed income portfolios and strategies. In addition, the company offers investment banking services, such as strategic advisory services and capital markets products; merger and acquisition, equities capital market, debt capital market, debt advisory and restructuring, and fund placement services; and institutional equity sales and trading, equity research, equity derivatives and index options, convertible bonds, trading, and investment services. Further, it provides institutional fixed income sales and trading, fixed income research, public finance, and municipal trading services; repurchase agreements and securities lending services; and proprietary trading and investment activities. Additionally, the company offers underwritings, market-making, trust, and discount services. It serves high-net-worth individuals and families, corporate executives, public and private businesses, institutions and corporations, governments, financial sponsors, and domestic and international investors. Oppenheimer Holdings Inc. was founded in 1881 and is headquartered in New York, New York.", "fullTimeEmployees": 2876, "companyOfficers": [{"maxAge": 1, "name": "Mr. Albert Grinsfelder Lowenthal", "age": 76, "title": "Chairman & CEO", "yearBorn": 1946, "fiscalYear": 2022, "totalPay": 1005750, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Robert Steven Lowenthal", "age": 46, "title": "Pres, Sr. Managing Director, Head of Oppenheimer & Co. Inc.'s Investment and Director", "yearBorn": 1976, "fiscalYear": 2022, "totalPay": 5300000, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Brad Michael Watkins CPA", "age": 40, "title": "Exec. VP & CFO", "yearBorn": 1982, "fiscalYear": 2022, "totalPay": 800000, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Bryan Edward McKigney", "age": 63, "title": "Pres of Oppenheimer Asset Management Inc", "yearBorn": 1959, "fiscalYear": 2022, "totalPay": 1225000, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Peter J. Albano", "title": "Sr. MD and Global Head of Fixed Income Bus. - Oppenheimer & Co. Inc.", "fiscalYear": 2022, "totalPay": 1500000, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Dennis Patrick McNamara Esq.", "title": "Exec. VP,  Gen. Counsel & Sec.", "fiscalYear": 2015, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Douglas Thornley Siegel", "title": "MD & Chief Compliance Officer", "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400}