{"address1": "420 Third Avenue", "address2": "PO Box 240", "city": "Gallipolis", "state": "OH", "zip": "45631", "country": "United States", "phone": "740 446 2631", "fax": "740 446 7414", "website": "https://www.ovbc.com", "industry": "Banks—Regional", "industryDisp": "Banks—Regional", "sector": "Financial Services", "longBusinessSummary": "Ohio Valley Banc Corp. operates as the bank holding company for The Ohio Valley Bank Company that provides commercial and consumer banking products and services. The company operates in two segments, Banking and Consumer Finance. It accepts various deposit products, including checking, savings, time, and money market accounts, as well as individual retirement accounts, demand deposits, NOW accounts, and certificates of deposit. The company also provides various residential real estate loans, including one-to four-family residential mortgages; commercial loans for securing equipment, inventory, stock, commercial real estate, and rental property; and consumer loans secured by automobiles, mobile homes, recreational vehicles, and other personal property, as well as personal loans, unsecured credit card receivables, floor plan and student loans, and construction loans. In addition, it offers safe deposit box, wire transfer, credit card, and Internet banking services; and financial management online services, such as cash management and news updates related to repossession auctions, current rates, and general bank news. Further, the company provides automatic teller machine services, consumer finance, seasonal tax preparation services, and commercial property and various liability insurance services, as well as trust and online-only consumer direct mortgage services. It operates offices in Ohio and West Virginia; and finance offices in Ohio. The company owns and operates ATMs, including off-site ATMs. Ohio Valley Banc Corp. was founded in 1872 and is headquartered in Gallipolis, Ohio.", "fullTimeEmployees": 275, "companyOfficers": [{"maxAge": 1, "name": "Mr. Larry E. Miller II", "age": 58, "title": "Pres, CEO & Director", "yearBorn": 1964, "fiscalYear": 2016, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Scott W. Shockey", "age": 52, "title": "Sr. VP & CFO", "yearBorn": 1970, "fiscalYear": 2016, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Ryan J. Jones", "age": 44, "title": "Chief Operating & Risk Officer", "yearBorn": 1978, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Bryan F. Stepp", "age": 59, "title": "Sr. VP of Lending/Credit", "yearBorn": 1963, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Tommy R. Shepherd", "age": 55, "title": "Sr. VP & Sec.", "yearBorn": 1967, "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 38.80978301577724, "longitude": -82.20534398323174}