{"address1": "601 West Market Street", "city": "Louisville", "state": "KY", "zip": "40202", "country": "United States", "phone": "502 584 3600", "website": "https://www.republicbank.com", "industry": "Banks—Regional", "industryDisp": "Banks—Regional", "sector": "Financial Services", "longBusinessSummary": "Republic Bancorp, Inc., a financial holding company, provides various banking products and services in the United States. It operates in five segments: Traditional Banking, Warehouse, Mortgage Banking, Tax Refund Solutions, and Republic Credit Solutions. The company accepts demand, money market accounts, savings, individual retirement accounts, time, brokered, and other certificates of deposit. Its loan products include residential real estate, commercial real estate, construction and land development, home equity, secured and unsecured personal, and aircraft loans. The company also offers credit cards; title insurance and other financial products and services; and private banking, lockbox processing, remote deposit capture, business online banking, account reconciliation, automated clearing house processing, and internet and mobile banking services. In addition, it provides short-term and revolving credit facilities to mortgage bankers; warehouse lending; tax refund solutions, which facilitate the receipt and payment of federal and state tax refund products through third-party tax preparers and tax-preparation software providers; and general purpose reloadable prepaid cards, payroll debit cards, and limited-purpose demand deposit accounts through third party service providers. Further, the company offers consumer credit products; and property and casualty insurance products, as well as checking and saving accounts, commercial accounts, marine lending, equipment leasing, employee services, and merchant solutions. Republic Bancorp, Inc. was incorporated in 1974 and is headquartered in Louisville, Kentucky.", "fullTimeEmployees": 1031, "companyOfficers": [{"maxAge": 1, "name": "Mr. Steven E. Trager", "age": 61, "title": "Exec. Chairman & CEO", "yearBorn": 1961, "fiscalYear": 2022, "totalPay": 804352, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Kevin  Sipes", "age": 50, "title": "Exec. VP, CFO, Chief Accounting Officer & Treasurer", "yearBorn": 1972, "fiscalYear": 2022, "totalPay": 603985, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. John T. Rippy", "age": 61, "title": "Assistant Sec.", "yearBorn": 1961, "fiscalYear": 2022, "totalPay": 572357, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. A. Scott Trager", "age": 69, "title": "Vice Chairman & Pres", "yearBorn": 1953, "fiscalYear": 2021, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Jim  Ensign", "title": "Sr. VP & Chief Brand Officer", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Christy A. Ames", "age": 49, "title": "Sec.", "yearBorn": 1973, "exercisedValue": 0, "unexercisedValue": 0}], "auditRisk": 9, "boardRisk": 8, "compensationRisk": 4, "shareHolderRightsRisk": 10, "overallRisk": 8, "governanceEpochDate": "2023-04-30 20:00:00", "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400}