{"address1": "20 Custom House Street", "city": "Boston", "state": "MA", "zip": "02110", "country": "United States", "phone": "617 951 0600", "fax": "617 603 4837", "website": "https://www.safetyinsurance.com", "industry": "Insurance—Property & Casualty", "industryDisp": "Insurance—Property & Casualty", "sector": "Financial Services", "longBusinessSummary": "Safety Insurance Group, Inc. provides private passenger and commercial automobile, and homeowner insurance in the United States. The company's private passenger automobile policies offer coverage for bodily injury and property damage to others, no-fault personal injury coverage for the insured/insured's car occupants, and physical damage coverage for an insured's own vehicle for collision or other perils. It also provides commercial automobile policies that offer insurance for commercial vehicles used for business purposes, including private passenger-type vehicles, trucks, tractors and trailers, insure individual vehicles, and commercial fleets; and homeowners policies, which provide coverage for homes, condominiums, and apartments for losses to a dwelling and its contents from various perils, and coverage for liability to others arising from ownership or occupancy. In addition, the company offers business owners policies that cover apartments and residential condominiums, restaurants, office condominiums, processing and services businesses, special trade contractors, and wholesalers. Further, it provides personal umbrella policies, which provide personal excess liability coverage over and above the limits of individual automobile, watercraft, and homeowner's insurance policies; and commercial umbrella and business owner policies, as well as underwrites dwelling fire insurance for non-owner-occupied residences. Additionally, the company offers inland marine coverage for homeowners and business owner policies, and watercraft coverage for small and medium sized pleasure crafts. It distributes its products through independent agents. The company was formerly known as Safety Holdings Inc and changed its name to Safety Insurance Group, Inc. in April 2002. The company was founded in 1979 and is headquartered in Boston, Massachusetts.", "fullTimeEmployees": 538, "companyOfficers": [{"maxAge": 1, "name": "Mr. George Michael Murphy C.P.C.U., CPCU", "age": 55, "title": "Pres, CEO & Director", "yearBorn": 1967, "fiscalYear": 2022, "totalPay": 1853190, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Christopher Thomas Whitford CPA", "age": 39, "title": "VP, CFO & Sec.", "yearBorn": 1983, "fiscalYear": 2022, "totalPay": 699754, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. James David Berry C.P.C.U., CPCU", "age": 62, "title": "VP of Underwriting", "yearBorn": 1960, "fiscalYear": 2022, "totalPay": 840006, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. John Patrick Drago", "age": 55, "title": "VP of Marketing", "yearBorn": 1967, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Glenn Robert Hiltpold", "age": 51, "title": "VP of Actuarial Services", "yearBorn": 1971, "exercisedValue": 0, "unexercisedValue": 0}], "auditRisk": 2, "boardRisk": 4, "compensationRisk": 2, "shareHolderRightsRisk": 3, "overallRisk": 2, "governanceEpochDate": "2023-04-30 20:00:00", "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400}