{"address1": "535 Fifth Avenue", "address2": "4th Floor", "city": "New York", "state": "NY", "zip": "10017", "country": "United States", "phone": "212 644 2400", "fax": "212 486 2784", "website": "https://www.siebert.com", "industry": "Capital Markets", "industryDisp": "Capital Markets", "sector": "Financial Services", "longBusinessSummary": "Siebert Financial Corp., through its subsidiaries, engages in the retail discount brokerage and investment advisory businesses in the United States and Internationally. It offers discount brokerage services, including self-directed trading, wealth management, financial advice, market making and fixed income investment, stock borrow, equity compensation plans, securities lending, equity stock plan, and market making services; independent retail execution services; and retail customer services. The company also offers self-directed retirement accounts, as well as lends customers a portion of the market value of marginable securities held in the customer's account. In addition, the company provides data technology platform that offers various services, such as email and messaging, market data systems and third party trading systems, business productivity tools, and customer relationship management systems. Further, it offers a Robo-Advisor platform that provides clients with an automated wealth management solution; and various insurance products, such as fixed annuities, personal insurance, property and casualty insurance, natural disaster insurance, and life and disability. The company has 12 branch offices in the United States. Siebert Financial Corp. was incorporated in 1934 and is headquartered in New York, New York. Siebert Financial Corp. was formerly a subsidiary of Kennedy Cabot Acquisition, LLC.", "fullTimeEmployees": 117, "companyOfficers": [{"maxAge": 1, "name": "Mr. Andrew Henry Reich", "age": 66, "title": "Exec. VP, COO, CFO, Sec. & Director", "yearBorn": 1956, "fiscalYear": 2022, "totalPay": 250000, "exercisedValue": 0, "unexercisedValue": 0}], "auditRisk": 8, "boardRisk": 10, "compensationRisk": 6, "shareHolderRightsRisk": 4, "overallRisk": 8, "governanceEpochDate": "2023-04-30 20:00:00", "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400}