{"address1": "500 Park Avenue", "address2": "Third Floor", "city": "New York", "state": "NY", "zip": "10022-1606", "country": "United States", "phone": "212 993 1670", "fax": "212 994 8545", "website": "https://slrinvestmentcorp.com", "industry": "Asset Management", "industryDisp": "Asset Management", "sector": "Financial Services", "longBusinessSummary": "SLR Investment Corp. is a business development company specializing in secured debt (first lien unitranche and second lien), subordinated (unsecured) debt, minority equity, leveraged buyouts, acquisitions, recapitalizations, general refinancing, growth capital and strategic income-oriented control equity investments in leveraged middle market companies. The fund invests in aerospace and defense; air freight & logistics; asset management; automotive; banking; beverage, food and tobacco; building products; buildings and real estate; broadcasting and entertainment; cargo transport; commercial services and supplies; communications equipment; chemicals, plastics and rubber; containers, packaging and glass; construction & engineering; diversified/conglomerate manufacturing; consumer Finance; distributors; diversified/conglomerate services; diversified financial services; diversified real estate activities; food products; Footwear; Education Services; diversified telecommunications services; electronics; farming and agriculture; finance; grocery; health care equipment and supplies; health care facilities; education and childcare; home and office furnishing, durable consumer products; hotels, motels, inns and gaming; insurance; restaurants, leisure, amusement, and entertainment; leisure equipment tolls and services, media, multiline retail, multi sector holdings; paper and forest products; personal products; professional services, research and consulting services, software; specialty retail; textiles apparel and luxury goods, thrifts and mortgage finance, trading companies and distributors, utilities, and wireless telecommunication services; industrial conglomerates; internet software and services, IT services, machinery; mining, steel, iron, and non-precious metals; oil and gas; personal, food and miscellaneous services; printing and publishing; retail stores; telecommunications; textiles and leather; and utilities. It also invests in life sciences with focus on specialty pharmaceuticals, medical devices, biotech, health Care Providers and services; health Care technology, enabling technologies and tools. The fund primarily invests in United States. The fund's investments generally range between $5 million and $100 million. The fund invests in companies with revenues between $50 million and $1 billion and EBITDA between $15 million and $100 million. It invests in the form of senior secured loans, mezzanine loans, and equity securities. It may also seek investments in thinly traded public companies and also make secondary investments. The fund makes non-control equity investments. It primarily exits within three years of the initial capital commitment.", "companyOfficers": [{"maxAge": 1, "name": "Mr. Michael Stuart Gross", "age": 60, "title": "Chairman, Pres & Co-CEO", "yearBorn": 1962, "fiscalYear": 2022, "totalPay": 0, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Bruce John Spohler", "age": 61, "title": "COO, Co-CEO & Interested Director", "yearBorn": 1961, "fiscalYear": 2022, "totalPay": 0, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Shiraz Y. Kajee CPA, CPA", "age": 42, "title": "CFO, Treasurer & Sec.", "yearBorn": 1980, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Richard R. Pivirotto Jr.", "title": "Investor Relations", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Guy Francis Talarico J.D.", "age": 67, "title": "Chief Compliance Officer", "yearBorn": 1955, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Anthony  Storino", "title": "Head of Healthcare Venture Lending", "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 32.2947329, "longitude": -64.7961749}