{"address1": "150 Almaden Boulevard", "address2": "Suite 1250", "city": "San Jose", "state": "CA", "zip": "95113", "country": "United States", "phone": "408 886 7096", "fax": "408 247 0524", "website": "https://www.firsthandtvf.com", "industry": "Asset Management", "industryDisp": "Asset Management", "sector": "Financial Services", "longBusinessSummary": "Firsthand Technology Value Fund, Inc. is a business development company specializes in venture capital investments in start-up, early stage, middle stage, late stage, early development stage, and PIPEs. It seeks to invest in pre-IPO companies. The fund also seeks to make investments in companies with operating histories that are unprofitable or marginally profitable, that have negative net worth, or that are involved in bankruptcy or reorganization proceedings. In addition, it also makes investments in connection with the acquisition or divestiture of companies or divisions of companies. The fund seeks to invest through direct investments in private companies, negotiations with selling shareholders, and in organized secondary marketplaces for private securities. It may also invest in micro-cap publicly traded companies and also make investments in securities of public companies. The fund seeks to invest in private technology, information technology, cleantech sector, and companies that possess patents and other defensible intellectual property rights with a focus on Internet, consumer electronics, computer hardware, computer software, social networking, computer peripherals, solar photovoltaic, energy efficiency, solid-state lighting, water purification, wind-generated electricity, fuel cells, bio-fuels, electronic components, semiconductors, telecommunications, and advanced materials. Cleantech companies include those engaged in the sale of goods and services designed to harness renewable energy and materials, eliminate emissions and waste, and reduce the use of natural resources. It invests primarily in equity securities of private companies in the United States. However the fund also invests in securities of public companies located outside of the United States. It seeks to invest between $1 million and $10 million each in its investee companies. The fund structures its equity investments as preferred stock, common stock, warrants, limited partnership interests, options, other beneficial ownership interests, convertible debt, short term debt investments, high-yield bonds, and distressed debt. It prefers to control, be represented on, or have observer rights on the board of directors of a portfolio company. The fund seeks to exit its investments through strategic acquisition by other industry participants, initial public offering of common stock, or other capital market transaction.", "companyOfficers": [{"maxAge": 1, "name": "Mr. Kevin Michael Landis", "age": 61, "title": "Chairman, Pres, CEO & Chief Investment Officer", "yearBorn": 1961, "fiscalYear": 2022, "totalPay": 0, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Omar Noorudin Billawala J.D.", "age": 61, "title": "Chief Financial Officer", "yearBorn": 1961, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Heather  Hohlowski", "title": "Investor Relation", "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Kelvin Karfun Leung J.D.", "age": 57, "title": "Gen. Counsel & Sec.", "yearBorn": 1965, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Nichole  Mileski", "age": 51, "title": "Chief Compliance Officer", "yearBorn": 1971, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Greg  Sheppard", "title": "Director of Research", "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 32.2947329, "longitude": -64.7961749}