{"address1": "3035 Leonardtown Road", "city": "Waldorf", "state": "MD", "zip": "20601", "country": "United States", "phone": "301 645 5601", "fax": "301 843 3986", "website": "https://www.cbtc.com", "industry": "Banks—Regional", "industryDisp": "Banks—Regional", "sector": "Financial Services", "longBusinessSummary": "The Community Financial Corporation operates as the bank holding company for Community Bank of the Chesapeake that provides commercial and retail banking services to individuals and businesses. The company offers demand, savings, money market, and time deposit accounts, as well as certificates of deposit; and commercial real estate and other non-residential real estate, residential first mortgage, residential rental mortgage, construction and land development, home equity and second mortgage, and commercial equipment loans, as well as commercial loan products, including term loans, demand loans, and lines of credit; consumer loans, such as loans for automobiles, boats, recreational vehicles, and trucks, home improvement loans, secured and unsecured personal lines of credit, and credit card loans. It also provides safe deposit box, night depository, cash vault, automated clearinghouse transaction, wire transfer, automated teller machine (ATM), online and telephone banking, retail and business mobile banking, remote deposit capture, reciprocal deposit, merchant card, credit monitoring, investment, positive pay, payroll, account reconciliation, bill pay, credit card, and lockbox services. The company was formerly known as Tri-County Financial Corporation and changed its name to The Community Financial Corporation in October 2013. The Community Financial Corporation was founded in 1950 and is headquartered in Waldorf, Maryland.", "fullTimeEmployees": 196, "companyOfficers": [{"maxAge": 1, "name": "Mr. James M. Burke", "age": 54, "title": "Pres, CEO, & Vice Chairman", "yearBorn": 1968, "fiscalYear": 2022, "totalPay": 842536, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Todd L. Capitani", "age": 55, "title": "Exec. VP & CFO", "yearBorn": 1967, "fiscalYear": 2022, "totalPay": 544384, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Christy M. Lombardi", "age": 45, "title": "Exec. VP, COO & Corp. Sec.", "yearBorn": 1977, "fiscalYear": 2022, "totalPay": 569105, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. William J. Pasenelli", "age": 63, "title": "Conusltant", "yearBorn": 1959, "fiscalYear": 2022, "totalPay": 902514, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Marlene  Smith", "title": "Exec. Assistant", "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 38.625180986069694, "longitude": -76.90959896748402}