{"address1": "5230 Las Virgenes Road", "city": "Calabasas", "state": "CA", "zip": "91302", "country": "United States", "phone": "818 591 9800", "website": "https://unicoamerican.com", "industry": "Insurance—Property & Casualty", "industryDisp": "Insurance—Property & Casualty", "sector": "Financial Services", "longBusinessSummary": "Unico American Corporation, an insurance holding company, underwrites property and casualty insurance in Arizona, California, Nevada, Oregon, and Washington. The company offers property, casualty, health, and life insurance products, as well as insurance premium financing and membership association services. Its commercial property coverage insures against loss or damage to buildings, inventory, and equipment from natural disasters, including hurricanes, windstorms, hail, water, explosions, and severe winter weather, as well as other events, such as theft and vandalism, fires, storms, and financial loss due to business interruption resulting from covered property damage. The company also offers commercial liability coverage that insures against third party liability from accidents occurring on the insured's premises or arising out of its operation; and writes policies to insure commercial property and commercial liability risks on a mono-line basis. In addition, it provides group dental, vision, and life insurance policies. Unico American Corporation markets its insurance products primarily through a network of independent brokers and agents. The company was incorporated in 1969 and is headquartered in Calabasas, California.", "fullTimeEmployees": 38, "companyOfficers": [{"maxAge": 1, "name": "Mr. Steven Latus Shea", "age": 63, "title": "CFO, CEO, Pres, COO & Chairman", "yearBorn": 1959, "fiscalYear": 2021, "totalPay": 216030, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Jennifer Elaine Ziegler CPA, CFE, CFF, CGMA, CPA", "age": 55, "title": "Principal Accounting Officer", "yearBorn": 1967, "fiscalYear": 2021, "totalPay": 102326, "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2021-12-30 19:00:00", "maxAge": 86400, "latitude": 34.15131401463938, "longitude": -118.69571898071828}