{"address1": "551 Fifth Avenue", "city": "New York", "state": "NY", "zip": "10176-0001", "country": "United States", "phone": "212 907 1500", "website": "https://www.valueline.com", "industry": "Financial Data & Stock Exchanges", "industryDisp": "Financial Data & Stock Exchanges", "sector": "Financial Services", "longBusinessSummary": "Value Line, Inc., together with its subsidiaries, produces and sells investment periodicals and related publications primarily in the United States. Its investment periodicals and related publications cover a range of investments, including stocks, mutual funds, exchange traded funds (ETFs), and options. The company's research services include The Value Line Investment Survey, The Value Line Investment Survey - Small and Mid-Cap, The Value Line 600, and The Value Line Fund Advisor Plus that provide statistical and text coverage of various investment securities, with an emphasis placed on its proprietary research, analysis, and statistical ranks. It also provides niche newsletters comprising Value Line Select, Value Line Select: Dividend Income & Growth, Value Line Select: ETFs, The Value Line Special Situations Service, The Value Line Climate Change Investing Service, and The Value Line Information You Should Know Wealth Newsletter that offer information on a less comprehensive basis for securities that are of particular interest to subscribers; digital versions of its products through its Website, www.valueline.com; The Value Line Research Center online platform; and investment analysis software, such as The Value Line Investment Analyzer, which includes data sorting and filtering tools. In addition, the company offers current and historical financial databases comprising DataFile, estimates and projections, and mutual funds; and copyright products, which include unit investment trusts, variable annuities, managed accounts, and EFTs. Further, it places advertising on behalf of the company's publications; and provides subscription fulfillment and subscriber relation services. The company serves individual and professional investors, as well as institutions, including municipal and university libraries, and investment firms. Value Line, Inc. was founded in 1931 and is headquartered in New York, New York. Value Line, Inc. is a subsidiary of Arnold Bernhard & Co, Inc.", "fullTimeEmployees": 140, "companyOfficers": [{"maxAge": 1, "name": "Mr. Howard A. Brecher", "age": 69, "title": "Chairman, CEO, Pres & Chief Legal Officer", "yearBorn": 1953, "fiscalYear": 2022, "totalPay": 789500, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Stephen R. Anastasio", "age": 63, "title": "VP, Treasurer & Director", "yearBorn": 1959, "fiscalYear": 2022, "totalPay": 714500, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Jason I. Wiseberg", "age": 52, "title": "Exec. VP of Sales", "yearBorn": 1970, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Mary  Bernstein", "age": 72, "title": "Sec. & Director", "yearBorn": 1950, "exercisedValue": 0, "unexercisedValue": 0}], "auditRisk": 9, "boardRisk": 10, "compensationRisk": 4, "shareHolderRightsRisk": 5, "overallRisk": 8, "governanceEpochDate": "2023-04-30 20:00:00", "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 40.75559657567908, "longitude": -73.97912703174126}