{"address1": "13319 Midlothian Turnpike", "address2": "PO Box 330", "city": "Midlothian", "state": "VA", "zip": "23113", "country": "United States", "phone": "804 897 3900", "fax": "804 897 9043", "website": "https://www.villagebank.com", "industry": "Banks—Regional", "industryDisp": "Banks—Regional", "sector": "Financial Services", "longBusinessSummary": "Village Bank and Trust Financial Corp. primarily operates as the bank holding company for Village Bank that provides banking and related financial services to small and medium sized businesses, professionals, and individuals. It operates in two segments, Traditional Commercial Banking and Mortgage Banking. The company accepts checking, savings, money market, and individual retirement accounts, as well as certificates of deposit and other depository services. It also offers secured and unsecured commercial business loans for various purposes, such as funding working capital needs and purchase of equipment and machinery; loans for acquiring, developing, constructing, and owning commercial properties; and secured and unsecured consumer loans for financing automobiles, home improvements, education, and personal investments, as well as originates mortgage loans, and real estate construction and acquisition loans. In addition, the company offers internet and mobile banking, and remote deposit capture services for business clients. Village Bank and Trust Financial Corp. was founded in 1999 and is headquartered in Midlothian, Virginia.", "fullTimeEmployees": 142, "companyOfficers": [{"maxAge": 1, "name": "Mr. James E. Hendricks Jr.", "age": 59, "title": "Pres, CEO & Director", "yearBorn": 1963, "fiscalYear": 2022, "totalPay": 459875, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Donald M. Kaloski Jr., CPA, CGMA", "age": 40, "title": "Exec. VP & CFO", "yearBorn": 1982, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Deborah M. Golding", "title": "VP & Corp. Sec.", "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": "2022-12-30 19:00:00", "maxAge": 86400, "latitude": 37.50184800359507, "longitude": -77.645050034693}